node {
  input: "input"
  output: "6"
  op_type: "Unsqueeze"
  attribute {
    name: "axes"
    ints: 2
    type: INTS
  }
}
node {
  input: "6"
  input: "weight"
  input: "bias"
  input: "running_mean"
  input: "running_var"
  output: "7"
  op_type: "BatchNormalization"
  attribute {
    name: "epsilon"
    f: 9.999999747378752e-06
    type: FLOAT
  }
  attribute {
    name: "momentum"
    f: 0.8999999761581421
    type: FLOAT
  }
}
node {
  input: "7"
  output: "8"
  op_type: "Squeeze"
  attribute {
    name: "axes"
    ints: 2
    type: INTS
  }
}
name: "torch-jit-export"
initializer {
  dims: 6
  data_type: 1
  name: "bias"
  raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
}
initializer {
  data_type: 7
  name: "num_batches_tracked"
  raw_data: "\000\000\000\000\000\000\000\000"
}
initializer {
  dims: 6
  data_type: 1
  name: "running_mean"
  raw_data: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
}
initializer {
  dims: 6
  data_type: 1
  name: "running_var"
  raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
}
initializer {
  dims: 6
  data_type: 1
  name: "weight"
  raw_data: "\234\227\314>\201\350Z?\3659<?\312\244*?\036\010\314>R\225s?"
}
input {
  name: "input"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 3
        }
        dim {
          dim_value: 6
        }
      }
    }
  }
}
input {
  name: "weight"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 6
        }
      }
    }
  }
}
input {
  name: "bias"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 6
        }
      }
    }
  }
}
input {
  name: "running_mean"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 6
        }
      }
    }
  }
}
input {
  name: "running_var"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 6
        }
      }
    }
  }
}
input {
  name: "num_batches_tracked"
  type {
    tensor_type {
      elem_type: 7
      shape {
      }
    }
  }
}
output {
  name: "8"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 3
        }
        dim {
          dim_value: 6
        }
      }
    }
  }
}
