ir_version: 5
graph {
  node {
    input: "0"
    input: "1"
    output: "2"
    op_type: "ReverseSequence"
    attribute {
      name: "batch_axis"
      i: 1
      type: INT
    }
    attribute {
      name: "time_axis"
      i: 0
      type: INT
    }
  }
  name: "ReverseSequence_graph"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
