ir_version: 5
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: "sequence_lens"
    input: "initial_h"
    input: "initial_c"
    input: "P"
    output: "Y"
    op_type: "LSTM"
    attribute {
      name: "activation_alpha"
      floats: 0.496663898229599
      floats: 0.43607014417648315
      floats: 0.8097313642501831
      type: FLOATS
    }
    attribute {
      name: "activation_beta"
      floats: 0.12651506066322327
      floats: 0.1647539585828781
      floats: 0.04623650014400482
      type: FLOATS
    }
    attribute {
      name: "activations"
      strings: "tanh"
      strings: "relu"
      strings: "sigmoid"
      type: STRINGS
    }
    attribute {
      name: "clip"
      f: 2.1357948780059814
      type: FLOAT
    }
    attribute {
      name: "direction"
      s: "forward"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 18
      type: INT
    }
    attribute {
      name: "input_forget"
      i: 1
      type: INT
    }
  }
  name: "LSTM_graph"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 72
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 72
          }
          dim {
            dim_value: 18
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 144
          }
        }
      }
    }
  }
  input {
    name: "sequence_lens"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "initial_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 18
          }
        }
      }
    }
  }
  input {
    name: "initial_c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 18
          }
        }
      }
    }
  }
  input {
    name: "P"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 54
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 18
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
