ir_version: 5
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: "sequence_lens"
    input: "initial_h"
    input: "initial_c"
    input: "P"
    output: "Y"
    op_type: "LSTM"
    attribute {
      name: "activation_alpha"
      floats: 0.20332784950733185
      floats: 0.22637955844402313
      floats: 0.6021193265914917
      floats: 0.6168572306632996
      floats: 0.40207403898239136
      floats: 0.036317259073257446
      type: FLOATS
    }
    attribute {
      name: "activation_beta"
      floats: 0.7717703580856323
      floats: 0.027305984869599342
      floats: 0.8047659397125244
      floats: 0.6452577710151672
      floats: 0.731901228427887
      floats: 0.25505176186561584
      type: FLOATS
    }
    attribute {
      name: "activations"
      strings: "tanh"
      strings: "tanh"
      strings: "sigmoid"
      strings: "relu"
      strings: "sigmoid"
      strings: "relu"
      type: STRINGS
    }
    attribute {
      name: "clip"
      f: 2.907158851623535
      type: FLOAT
    }
    attribute {
      name: "direction"
      s: "bidirectional"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 16
      type: INT
    }
    attribute {
      name: "input_forget"
      i: 10
      type: INT
    }
  }
  name: "LSTM_graph"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "sequence_lens"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "initial_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  input {
    name: "initial_c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  input {
    name: "P"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 48
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
