ir_version: 5
graph {
  node {
    input: "x"
    output: "y"
    op_type: "Selu"
    attribute {
      name: "alpha"
      f: 2.0
      type: FLOAT
    }
    attribute {
      name: "gamma"
      f: 3.0
      type: FLOAT
    }
  }
  name: "Selu_graph"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
