ir_version: 5
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: "sequence_lens"
    input: "initial_h"
    input: "initial_c"
    input: "P"
    output: "Y"
    op_type: "LSTM"
    attribute {
      name: "activation_alpha"
      floats: 0.5494076013565063
      floats: 0.44860225915908813
      floats: 0.8555569052696228
      floats: 0.3638591468334198
      floats: 0.27860602736473083
      floats: 0.37095943093299866
      type: FLOATS
    }
    attribute {
      name: "activation_beta"
      floats: 0.684103786945343
      floats: 0.12454085797071457
      floats: 0.16010195016860962
      floats: 0.4364536702632904
      floats: 0.20068275928497314
      floats: 0.025382308289408684
      type: FLOATS
    }
    attribute {
      name: "activations"
      strings: "relu"
      strings: "tanh"
      strings: "relu"
      strings: "sigmoid"
      strings: "sigmoid"
      strings: "tanh"
      type: STRINGS
    }
    attribute {
      name: "clip"
      f: 7.524947643280029
      type: FLOAT
    }
    attribute {
      name: "direction"
      s: "bidirectional"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 2
      type: INT
    }
    attribute {
      name: "input_forget"
      i: 19
      type: INT
    }
  }
  name: "LSTM_graph"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 9
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  input {
    name: "sequence_lens"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "initial_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "initial_c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "P"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 9
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
