ir_version: 5
graph {
  node {
    input: "0"
    input: ""
    input: "1"
    input: "3"
    output: "2"
    op_type: "Loop"
    attribute {
      name: "body"
      g {
        node {
          input: "1"
          input: "3"
          output: "2"
          op_type: "Add"
        }
        name: "graph"
        input {
          name: "0"
          type {
            tensor_type {
              elem_type: 7
              shape {
                dim {
                  dim_value: 1
                }
              }
            }
          }
        }
        input {
          name: "1"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_value: 4
                }
                dim {
                  dim_value: 5
                }
              }
            }
          }
        }
        input {
          name: "3"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_value: 4
                }
                dim {
                  dim_value: 5
                }
              }
            }
          }
        }
        output {
          name: "2"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_value: 4
                }
                dim {
                  dim_value: 5
                }
              }
            }
          }
        }
      }
      type: GRAPH
    }
  }
  name: "Loop_graph"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
