ir_version: 5
graph {
  node {
    input: "0"
    output: "1"
    op_type: "StringNormalizer"
  }
  name: "StringNormalizer_graph"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 8
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 8
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
