ir_version: 5
graph {
  node {
    input: "0"
    output: "1"
    op_type: "DepthToSpace"
    attribute {
      name: "blocksize"
      i: 2
      type: INT
    }
  }
  name: "DepthToSpace_graph"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
