node {
  input: "0"
  input: "weight"
  input: "bias"
  output: "3"
  op_type: "Conv"
  attribute {
    name: "dilations"
    ints: 1
    ints: 1
    type: INTS
  }
  attribute {
    name: "group"
    i: 1
    type: INT
  }
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
    type: INTS
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
    type: INTS
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
    type: INTS
  }
}
name: "torch-jit-export"
initializer {
  dims: 5
  data_type: 1
  name: "bias"
  raw_data: "\313g\301\275\022_)\276\234\354\020\276\266\264\272=w|&>"
}
initializer {
  dims: 5
  dims: 4
  dims: 3
  dims: 3
  data_type: 1
  name: "weight"
  raw_data: "$\210:=(\325\301<(\300\370<b\264\251=`9\"\276{\374\201\275XN\202=\330\226\371<\\B\007=\350\253\201<\350\026\345\275%m\001>6\264\223=q;\000>\010}\211\274\006\352\311\275\210\255\271<\372/$\276`\333\023\276\233\007\037\276H#\320<\226.\272\275\210\377%\276K\002\231\275G\270$>\201\330\003>{\362\201\275%\253\006>\263p\010>\350\002\026\276H\221\000\276\317\t\030>SV\202\275\300\r\026\276\271J\020>\270\032\321\275\004\356\026\275\214\266\037\275\322\305\322=\300\242[\274\274\336K\275\277o\016\276\265e\026>,\310B=T\346\023=\334V\021\2758Y\256<\022\220\324=\216I\300\275\233\254\210\275\231\367\">.\337\311= \216\276\273^e\361=\200:\202:\260\202\"\274_A\r>\022\373\355=\000\203\002\276z/\037\276\321\327\027>T\307E=xc\242=\356O\200\275\304j0=\220\304(\274\014\"u\275Y\275\023>\343\306\345\275\016o\211=\370\243\327\275+D\035\276\033\301\017\276\2608~=\021n\022>\\\003y=\366\351\366\275+%\266\275\326\337\010\276\222d*\2766\263\355=\354P\031=\214cs\275\024\233\005=B\353\225=\220\013m\275F\372\341\275\266\304\005\276\256a\370\275\020\206`\275\270|\034\2766\224\224\275\020&\r\274\360[\002\276\316\333\360=\220\360\370\275 \030U=\010\314\337\274\200\205\306<0\240\200=\326\324\221\275\000\033\270\2754>(=x\377\276\275\200\246K<c\204\034\276\006\375T\275\260\216\030=+\\\237\275|l]\275\346\272\347=\332,\217=\030\311\207<P\373\035\275\241\233&>\364w%\276\000\t\n=g\371)>u\331\007>\300\253|\274\216\030\214\2752}\322=\354\273u=V\211!\276\2531\325\275\327\374\013\276\314]r\275N\\\300=\220|:\275\324\241\035=\n\377\035\2766\031\202=\263\221\214\275\306\227\213=\226\373\216=@B\320\275\264\030X=\031A\025>\210\207\246=.\301\363\275\200\007\026\276\3132\020>\306\373\310=\252\260\342=\214\004\014\275)\205\033>\344q{=\270K\212\274\256\022\367\275 E>\275:\323\330=\351\340(>\220|\315\275\000\0354\2746U\215=\027\223\024\276f\2275\275_x\r>\010s\033\276\037m\032>\000\373(\273\030\016\237=\333\343\017>`m\204<\200N\252<\310\273\017\276\220\253N<@\330p;\364\221w=4Y\025\276P\177\013\274\220\247\'=(\202\345\274D\000\031\275\032\232\361=@\032g\275\333\257\365\275P.\001\27606\250\275\022\375\324="
}
input {
  name: "0"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 1
        }
        dim {
          dim_value: 4
        }
        dim {
          dim_value: 5
        }
        dim {
          dim_value: 6
        }
      }
    }
  }
}
input {
  name: "weight"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 5
        }
        dim {
          dim_value: 4
        }
        dim {
          dim_value: 3
        }
        dim {
          dim_value: 3
        }
      }
    }
  }
}
input {
  name: "bias"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 5
        }
      }
    }
  }
}
output {
  name: "3"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 1
        }
        dim {
          dim_value: 5
        }
        dim {
          dim_value: 3
        }
        dim {
          dim_value: 4
        }
      }
    }
  }
}
