ir_version: 5
graph {
  node {
    input: "0"
    output: "1"
    op_type: "TfIdfVectorizer"
    attribute {
      name: "max_gram_length"
      i: 2
      type: INT
    }
    attribute {
      name: "max_skip_count"
      i: 0
      type: INT
    }
    attribute {
      name: "min_gram_length"
      i: 2
      type: INT
    }
    attribute {
      name: "mode"
      s: "TF"
      type: STRING
    }
    attribute {
      name: "ngram_counts"
      ints: 0
      ints: 4
      type: INTS
    }
    attribute {
      name: "ngram_indexes"
      ints: 0
      ints: 1
      ints: 2
      ints: 3
      ints: 4
      ints: 5
      ints: 6
      type: INTS
    }
    attribute {
      name: "pool_int64s"
      ints: 2
      ints: 3
      ints: 5
      ints: 4
      ints: 5
      ints: 6
      ints: 7
      ints: 8
      ints: 6
      ints: 7
      type: INTS
    }
  }
  name: "TfIdfVectorizer_graph"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 7
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
