ir_version: 5
graph {
  node {
    input: "0"
    output: "1"
    op_type: "Sqrt"
  }
  name: "Sqrt_graph"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
