ir_version: 5
graph {
  node {
    input: "0"
    input: "1"
    input: "2"
    output: ""
    output: "3"
    op_type: "GRU"
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
  }
  name: "GRU_graph"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 15
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 15
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
