ir_version: 5
graph {
  node {
    input: "0"
    output: "1"
    op_type: "ThresholdedRelu"
    attribute {
      name: "alpha"
      f: 2.0
      type: FLOAT
    }
  }
  name: "ThresholdedRelu_graph"
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
