ir_version: 5
graph {
  node {
    input: "x"
    output: "y"
    op_type: "LRN"
    attribute {
      name: "alpha"
      f: 9.99999974738e-05
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 0.75
      type: FLOAT
    }
    attribute {
      name: "bias"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "size"
      i: 3
      type: INT
    }
  }
  name: "LRN_graph"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
