node {
  input: "0"
  output: "1"
  op_type: "MaxPool"
  attribute {
    name: "kernel_shape"
    ints: 3
    ints: 3
    type: INTS
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
    type: INTS
  }
  attribute {
    name: "strides"
    ints: 1
    ints: 1
    type: INTS
  }
}
name: "torch-jit-export"
input {
  name: "0"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 1
        }
        dim {
          dim_value: 4
        }
        dim {
          dim_value: 5
        }
        dim {
          dim_value: 5
        }
      }
    }
  }
}
output {
  name: "1"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 1
        }
        dim {
          dim_value: 4
        }
        dim {
          dim_value: 3
        }
        dim {
          dim_value: 3
        }
      }
    }
  }
}
