ir_version: 5
graph {
  node {
    input: "X"
    output: "Y"
    op_type: "IsInf"
    attribute {
      name: "detect_negative"
      i: 1
      type: INT
    }
    attribute {
      name: "detect_positive"
      i: 1
      type: INT
    }
  }
  name: "IsInf_graph"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
