ir_version: 5
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: "sequence_lens"
    input: "initial_h"
    input: "initial_c"
    input: "P"
    output: "Y"
    op_type: "LSTM"
    attribute {
      name: "activation_alpha"
      floats: 0.15088558197021484
      floats: 0.4507448673248291
      floats: 0.4165613055229187
      type: FLOATS
    }
    attribute {
      name: "activation_beta"
      floats: 0.5657658576965332
      floats: 0.21611301600933075
      floats: 0.15922968089580536
      type: FLOATS
    }
    attribute {
      name: "activations"
      strings: "tanh"
      strings: "relu"
      strings: "sigmoid"
      type: STRINGS
    }
    attribute {
      name: "clip"
      f: 3.176703691482544
      type: FLOAT
    }
    attribute {
      name: "direction"
      s: "forward"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 16
      type: INT
    }
    attribute {
      name: "input_forget"
      i: 14
      type: INT
    }
  }
  name: "LSTM_graph"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 9
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 9
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 128
          }
        }
      }
    }
  }
  input {
    name: "sequence_lens"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "initial_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  input {
    name: "initial_c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
  input {
    name: "P"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 48
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 16
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
