ir_version: 5
graph {
  node {
    input: "x"
    input: "y"
    output: "z"
    op_type: "Xor"
  }
  name: "Xor_graph"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "y"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "z"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
