node {
  input: "input"
  output: "1"
  op_type: "Softmax"
  attribute {
    name: "axis"
    i: 0
    type: INT
  }
}
name: "torch-jit-export"
input {
  name: "input"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 6
        }
      }
    }
  }
}
output {
  name: "1"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 6
        }
      }
    }
  }
}
