node {
  input: "input"
  output: "1"
  op_type: "Elu"
  attribute {
    name: "alpha"
    f: 1.0
    type: FLOAT
  }
}
name: "torch-jit-export"
input {
  name: "input"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 10
        }
      }
    }
  }
}
output {
  name: "1"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 10
        }
      }
    }
  }
}
