ir_version: 5
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: "sequence_lens"
    input: "initial_h"
    input: "initial_c"
    input: "P"
    output: "Y"
    op_type: "LSTM"
    attribute {
      name: "activation_alpha"
      floats: 0.28920620679855347
      floats: 0.7474650740623474
      floats: 0.6611623167991638
      floats: 0.8477376103401184
      floats: 0.078818179666996
      floats: 0.16208001971244812
      type: FLOATS
    }
    attribute {
      name: "activation_beta"
      floats: 0.7627506852149963
      floats: 0.6606114506721497
      floats: 0.9585331082344055
      floats: 0.5549681186676025
      floats: 0.05904259532690048
      floats: 0.046482544392347336
      type: FLOATS
    }
    attribute {
      name: "activations"
      strings: "sigmoid"
      strings: "sigmoid"
      strings: "tanh"
      strings: "relu"
      strings: "relu"
      strings: "tanh"
      type: STRINGS
    }
    attribute {
      name: "clip"
      f: 3.879685163497925
      type: FLOAT
    }
    attribute {
      name: "direction"
      s: "bidirectional"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 10
      type: INT
    }
    attribute {
      name: "input_forget"
      i: 11
      type: INT
    }
  }
  name: "LSTM_graph"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 40
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 40
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 80
          }
        }
      }
    }
  }
  input {
    name: "sequence_lens"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  input {
    name: "initial_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  input {
    name: "initial_c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  input {
    name: "P"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 30
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
