ir_version: 5
graph {
  node {
    input: "x"
    output: "y"
    op_type: "RandomNormalLike"
    attribute {
      name: "mean"
      f: 0.0
      type: FLOAT
    }
    attribute {
      name: "scale"
      f: 1.0
      type: FLOAT
    }
  }
  name: "RandomNormalLike_graph"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
