node {
  input: "input"
  output: "1"
  op_type: "Pad"
  attribute {
    name: "mode"
    s: "constant"
    type: STRING
  }
  attribute {
    name: "pads"
    ints: 0
    ints: 0
    ints: 2
    ints: 2
    ints: 0
    ints: 0
    ints: 2
    ints: 2
    type: INTS
  }
  attribute {
    name: "value"
    f: 4.5
    type: FLOAT
  }
}
name: "torch-jit-export"
input {
  name: "input"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 1
        }
        dim {
          dim_value: 3
        }
        dim {
          dim_value: 4
        }
        dim {
          dim_value: 4
        }
      }
    }
  }
}
output {
  name: "1"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 1
        }
        dim {
          dim_value: 3
        }
        dim {
          dim_value: 8
        }
        dim {
          dim_value: 8
        }
      }
    }
  }
}
