ir_version: 5
graph {
  node {
    input: "x"
    output: "y"
    op_type: "LogSoftmax"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "LogSoftmax_graph"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
