ir_version: 5
graph {
  node {
    input: "X"
    output: "Y"
    op_type: "Hardmax"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "Hardmax_graph"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
