ir_version: 4
producer_name: "pytorch"
producer_version: "1.2"
graph {
  node {
    output: "5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\020\003\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "0"
    input: "5"
    output: "6"
    op_type: "Reshape"
  }
  node {
    input: "6"
    input: "fc.weight"
    input: "fc.bias"
    output: "7"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  node {
    input: "7"
    output: "8"
    op_type: "Relu"
  }
  node {
    input: "8"
    input: "fc2.weight"
    input: "fc2.bias"
    output: "9"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 1.0
      type: FLOAT
    }
    attribute {
      name: "transB"
      i: 1
      type: INT
    }
  }
  node {
    input: "9"
    output: "10"
    op_type: "LogSoftmax"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "torch-jit-export"
  initializer {
    dims: 1
    data_type: 1
    name: "fc.bias"
    raw_data: "\247\374\010?"
  }
  initializer {
    dims: 1
    dims: 784
    data_type: 1
    name: "fc.weight"
    raw_data: "V\300\226<z\"\201\274\224\337\342\273\356R\211<\002\270\t\275\314u\257<\344\301\360\273\014\330\224<\210\260\242;pK\217\273\270K\"<\340\355\346:\377\361\024\275\343\265\201\275\360\245*\273 \267R\2738\240\251;\000\232\025\271\226\301\377<8\0276<.\351Y\274\254\263\260\274\200(\304\273\\e|\274\030\202;\274\000$\340:\362h\256<\370\005\237<r\000\017\275\374^\265<\300w#<\227\302\n=Z\035\301<\365!\003\276\260\016\244\276\201\220\246\276\222_p\2762\227\211\276;\207\210\276\270Z\235\276\r\027\227\276\240\273\252\276*}\037\276\t&g\276ci\231\276T,\206\276\365\030u\276\237\317K\276\017\313\202\276\352\212H\276*\370\203\276\375\020O\276\\\302\236<$<\016\2743\265\021=\232\205\352< 0\333\272XI\303\274:*\262<\360\024\020\276+l4\276\246\355\260\275\200\207\217\276\217>\336\276h\217\002\277\224\265\013\277~\261%\2772\332(\277~\3503\277k\3331\277\002\\\022\277<\007\363\2760D\364\276\010\314\273\276P\254\247\276+\214^\276\362\034\354\275f2\216\276\014#\275\2765?\211\276\353\t;\276\032\2158\276 W\016;\324l\307\273\220\325\253<Ep\251\274\235\013\002\275+\371\\\276\2735B\276L\001\233\274\207,\236\276\357\313\013\277\014\315\033\277\325D0\277)SA\277?\000H\277\037\005P\277o\333r\277\361\367p\277RCT\277\311\223\034\277,X\365\276_f\037\276Q\036\027\276K0\362\275\357@l=\237\203\265=\003T\010>LH\314\274\036$\007\2768\240I\275\354\211\332<\323\265\n=\325\372\231\274\261\326~=|\363\261<\007\206\021>\215\242B=u\230\014\275+\257\223=\315]Y=\rI\033<\344\316\257<YQ\362:6\322\273\274\363\201\230\275*\303\225\275\315\320x\275%\226a\275>\037\021\275`7%\275Z`+\275<\334\260\274E\245-=\250^\342\274[\201\257=AJ\202>\361z|>&\030_=\007\273I\275\360\017\206\274hF\210\273K6\344\275\255%\261\273v\2321=Oc+= \267\345=lG\372=S\010\335=>i\036>\215J\222=\275\324\227=\330eG=\243M\022=u\203\356\273,\210L\275L\223\206\275P\025\207\275\303<&=\326\314\023<\354\202\254\274\3509\263<KY\264<;\364\037>\335\322>>\3217\205>\2452\\\275^\307.\275\323\'\351\274\307\330]=`\336\310\274\372\236f=\373\023\277=A6\004>\342\235\233=>\025\203=\311t\013>\215+?>;\206\304=wTt=\263v\021\275\006&\256\274\034\276T\275\"5\036\273\373i\006<G\3567=A\376\006\274\270}\364<\234\037H<4\031\304<hP\224=\217x\334=\261\314\276=\222Y\327=\302\221\006>,\370\023=\000\026\222\275\354\343\322:\2737O>1\034!>\223b!<*\227!\275\322\2624\273\341u\024\275\332\251\305=m-\247={\200\002=\356\3410\275u\226(\275\207\253x;\0362\211\274\2645s=\247\371\273<\217K\013=\272I3\274\235\2714\273P)%=\334~\203\275W8\265<\235\367\336=j:\260<\342\330X=W:\376=\200\377\267<\004\311-\2760v\243\276\355\276\244=\371\234\005>\357e\010>\246x\277<M\340\254\274\366<\212;+w\302=\341\323\251=\353\366\310=\321&\212=\323\353\370<c\331\250<Hw \275t(P\275\277o\023\2754\260\036\275\n}\'<\345s\202:\247\316/=\201\240\256\273\177\316X=q\305N=\347\243\265=\346\263\312=.0\022>\315z)\275\212pQ=)\235\267\275\351\020q=\215_\027>\257:\212=\\\035\\=\317\033\033=i!&;4\202\205==Q\357=~\240\366=\322\234C>\367@\032>=j\214\275\362h\022\276\016t\316\275%?\241=a\030v=\213\346\254=\226\002\253=\246\026\235=\233\033o=\366\217\037=L\022\267\274\273\246\273\275\026(K\275\253\317\345=~~\016>\351\216w=\336\311\016=Q2 >\207|\026>\355\223\362\271\204`J=\366\224\226<\331\361\'=\335\352$=\226j\237=b\236\373=L\246\026>\005D\025>V\336\213\275P\224Y\276tz\017\275\220F&>\231\2309>8\256\270=\362T\233=\004\016\236=\340\362z=\277\206\261=g~\211\274\306>1\274\334\206v=\266p)=m\274H>\340\341\031>\334\"\261=U\220K=!\263\306=\214\213\016;\343j\275=?z\341=\351\340/=B\326\366=[\232\t>]\367\010>\257@d>\305\253\201>X\031\255=&2U\275d6\201=@\343\201>&\271\201>\214\000\323=\013\022[=v\230\227=>N\207<a\355\257=$\331\341\275\335\327\214\275\237\006#<h\r\265\2750Q\342\273\303\002\220\274\255~R=6\245\300=d\256^=\254\371\014>6E\017>@\214\307=\006\223\016>\026\241\r>\341\256\034>^\017\373=\240\271&>\361jD>F\027\316=\311\302\346\275\343Y== \034\216>\226\373\232>\rw=>\3539\210=<c:<e\324\377\274\002\204\025<\360\211\t\276PT\240\276\346=\306\275b\177$\276[R\033\275Pgp<E,[=*\202\216\275^\222b=\273\006\235>\311\020\211>\001\213\034>5\345\031>\341b\032>W\211\374=\343H\274=\224\356\350=\2535%>\247\305E=??\027\276\265\270\006>\237\212\217>\303\350\241>\237\007\205>\344%\346=_\020\003=4^Z=\024\035\201\275\240\031\223\276\030\210\306\276\226\'&\276}wq\276\263\261\353\275\030$\307\275\225pA=\363\336_\275\216\rm>\253\265\346>M\034\210>\366E:>\227B!>=q\315=\367\302\222=6(h\275\326-B=\356\0172>\317\032\270\275\032\224\255\275\024~\375=\0024\207>Y\210\303>\256\177o>bF5>\017-\001>tv\246<\025\017\303;\240\231\013\276\303\365\266\276\311z\201\276c\345\300\276@%0\276D\273\373\275\216\026\223=\210D\313\274\"\213\236>\267Q]>\336\372\021>y\271\001>3\035\236=\254%\260=\240\250\001\275&dD\275\"\020\003>o$;>a\277m\2753@Q\275\006&\002>h\177\234>\271V\304>\356i*>Eo\223=\354 +=z\340\275= \247\202=\214&\271\274\263\002\307\276(k\327\276\370\340\360\275\213\3516=\306V\n>\342\257\010\275\270t\340=`E\371=;\361\367\275\253\342\254\275\354-\307<\343\212\266=\376\371\322=\206d\307;N/\006\274\014\344\034>@\221\\>\027\300\215\275\340\355\305\274\013H\200>/\240\253><\'\227>\241\030\246<)e\224\275\336\360\230\274k\r}\274\017\267\231<\0144\032\276\374\325\303\276\023^\377\276\275\310\220\276ib\247\275N\031\014\275s\216\360=\362wX>}\231W\275rH\252\276e\245\233\276J\2278\276\272\221\325\275\236\007=\274\304*=\275\236\351U\275\344\3540>\314\003\006>\361P\213=D\321\252=IL\224>#\301i>\004\305t<\\-\240\275\251\016\341\275\025d\250\275\r\217\362\275\325;\360\275\033\2519\276\203\331\362\276*O\376\276\014\002\324\276\325dZ\276\253\266\021>Q\227\263=\352\251\216>\037\001\325\2725\230\205\276z\257\214\276M:\205\276_\264\205\276v\257\256\276]zh\276\024\356\204\276^BS\276\006\223\032\276%\000\226\275\376%3<\020qt=\036o\321\275K\331.\276b5\025\276s\005\374\275\177I\021\276[jL\276\225\352\026\276#\344\211\276&9\345\276\323\207\327\276\n\035\000\2765\332\367\275n\334\201<\304\256\263=&=`>\314\260\244=@l\000\275\371\351\246\275\324\027\020\276b3X\276\226\333\256\276\337\240\340\276\016\206\374\276+\212\t\277\354\336\361\276 \267\240\276\366>D\276\302\2367\276myo\276\230\266\020\2761\031\002\276\215\022\006\276\022\353\330\275\343\360\"\276\245\232?\276 \013\204\276Y\341\217\276\325,\226\276\010\366\026\276\000\364\'\276\360\374\200\274\033~\232\273\010\030}=\217^\352<i\261\327\2743\332\337\273\025\232\027\275U\370\203\275e\235\341\275\021\265Z\276\216\300\223\276\323\036\312\276+\336\304\276\3721\222\276\013\311N\276\336|5\276g\226$\276q*\013\276\034\002\342\275R[\346\275\371\245:\275\036\367\225\275\\C\022\276\"\347u\276\310om\276\330\036\010\276$c%\276fD~\275\236\237\205<@\217\234=\243\322\347;\266\217y\275\354x\014\275\256gU\274d\355\021\275\336\236\251<\261\3171\274e\356\n\275\317uB\275OC\205\275\330\\\363\274\255\020\333\2758X\260\275l\241\277\275\273\341\342\275\002\317\306\275{\243\273\275-z\245\275~(\273\275\325I\253\275r;&\276y\343\216\276r\270R\276\363\003[\276O\372k\276\366\232\305<\2504V<\357\266\031>S\337\003>\306[\207=\033\317|<MU8\276\036\'\003\276W?\301\275\333\036\232\275\233U\210\275\216\364<\275a\367\224<X\223\314\273M\225\023\275pd\217\275`A\241\275\310\337>\275K*\275\275\360\257\003\276*\023\010\276d\326,\276z\366C\276{\235Z\276\312\364S\276]M\355\275J\342R\276\376l+\275\226\321\355<\346b\272<\232|\201<@\301\255<\367\372.>\217\221`\275\211@D\276\200\255J\276\347\232\275\2754?\354\275m*\031\276y\326\200\275\323+\227<\366\032\261\274\210\202\203;\014\312\370\274\315yX\275\366?\373\2755[\034\275\262z}\275\205\017\027\276\320Q\305\275\3145\213\275\376\365=\274\315E\r;,\210\223<\366\305&\276Gw\347\275p>\203\273\234\205\007\275\250\375\330;\232\216\322=O\226\217=m~\363=\227\367\016=\007\034\300\274\373`\035\275\242\0369\275J4\323\275\326\263\\\275f\302m\275\215\303\007\276\270\304\'\276\350w\027\276:2\"\276(\247\377\274l\236\n=\274K\341=\033Zd>\001\373\252>6y\234>9\237r>kyT>\257T!\275\266\274S\276\260\271\362\2750\362\315<\356\227\272\274\245\217\252\274\343&\226=\366\306\234<:)a>t!\024?o\223\n?UY\020?T\213\326>T\'\265>\020\t\266>\213\300\232>\370=\242>ji\226>\341\324\216>7\262\261>\265;\351>*\364\004?\201u\030?\355F\035?)#1?\200\323\004?\206\256\257>\224+\202>\261L\366=x\250u\275\227\314\010\276\334.b\274\200\371\034;\306\311`\274\247\270\t=\220g\024>\3760\217>\333\311\317>ff\005?LW\010?\233f\016?O-\375>`\210\316>\"y\335>\313\271\003?\374\273\024?8>-?\206\025\014?\nF\004?0\371\003?Y\337\374>v\221\330>\351\313\327>zu\230>\344l\223>.\354u>E\334\323=\327;\262=\0228L\274\316\307\347<\256\014\337<\002\257\272<\006\221t\274\344\305\347\273\221g\357\275\236\010\210\275d\200\276=\352\240y\274\210\206a\275q%,=\037\211U=\005N\024=wb\263=\221\253x=\271\367\031>\323\235\016>~I\247\273\367.\214\275\332\236\302\275\\]\374\275\354\013\013>\005\031.>CP2>@\n\017>Pa\213\274`%\336;\200%\206\273\260\034$;"
  }
  initializer {
    dims: 10
    data_type: 1
    name: "fc2.bias"
    raw_data: "jE\267?\360\300\312?\274\274\234?\341\354\016?\353\000\312\277\204\350\031?\"\034\265?S\235\215\277V\340\017?G\374\366\277"
  }
  initializer {
    dims: 10
    dims: 1
    data_type: 1
    name: "fc2.weight"
    raw_data: "cM\313\277\371}\314\277\031\030d\277\376-q>t\377c?J\212\037>\246\302\272\277\322\017S?;fh>?Pv?"
  }
  input {
    name: "0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 784
          }
        }
      }
    }
  }
  input {
    name: "fc.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 784
          }
        }
      }
    }
  }
  input {
    name: "fc.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "fc2.weight"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "fc2.bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "10"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
