ir_version: 5
graph {
  node {
    input: "D"
    output: "R"
    op_type: "ReduceLogSum"
    attribute {
      name: "axes"
      ints: 0
      ints: 1
      type: INTS
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "ReduceLogSum_graph"
  input {
    name: "D"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
