ir_version: 5
graph {
  node {
    input: "x"
    input: "w"
    input: "r"
    output: "y"
    op_type: "LSTM"
    attribute {
      name: "activations"
      strings: "sigmoid"
      strings: "tanh"
      strings: "relu"
      type: STRINGS
    }
    attribute {
      name: "direction"
      s: "reverse"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 3
      type: INT
    }
  }
  name: "LSTM_graph"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "w"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "r"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
