ir_version: 5
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: "sequence_lens"
    input: "initial_h"
    input: "initial_c"
    input: "P"
    output: "Y"
    op_type: "LSTM"
    attribute {
      name: "activation_alpha"
      floats: 0.9958868622779846
      floats: 0.5615704655647278
      floats: 0.5054884552955627
      floats: 0.5125119090080261
      floats: 0.18310275673866272
      floats: 0.49901193380355835
      type: FLOATS
    }
    attribute {
      name: "activation_beta"
      floats: 0.28764665126800537
      floats: 0.560778796672821
      floats: 0.2632346749305725
      floats: 0.13121922314167023
      floats: 0.8822817802429199
      floats: 0.9880592226982117
      type: FLOATS
    }
    attribute {
      name: "activations"
      strings: "tanh"
      strings: "relu"
      strings: "tanh"
      strings: "sigmoid"
      strings: "sigmoid"
      strings: "relu"
      type: STRINGS
    }
    attribute {
      name: "clip"
      f: 6.1171088218688965
      type: FLOAT
    }
    attribute {
      name: "direction"
      s: "bidirectional"
      type: STRING
    }
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
    attribute {
      name: "input_forget"
      i: 17
      type: INT
    }
  }
  name: "LSTM_graph"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 20
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 40
          }
        }
      }
    }
  }
  input {
    name: "sequence_lens"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "initial_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "initial_c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "P"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 15
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
