node {
  input: "input"
  output: "1"
  op_type: "Relu"
}
name: "torch-jit-export"
input {
  name: "input"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 2
        }
      }
    }
  }
}
output {
  name: "1"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 2
        }
      }
    }
  }
}
