ir_version: 5
graph {
  node {
    input: "A"
    input: "B"
    input: "C"
    output: "Y"
    op_type: "Gemm"
    attribute {
      name: "alpha"
      f: 1.22000002861
      type: FLOAT
    }
    attribute {
      name: "beta"
      f: 5.30000019073
      type: FLOAT
    }
    attribute {
      name: "transA"
      i: 1
      type: INT
    }
    attribute {
      name: "transB"
      i: 0
      type: INT
    }
  }
  name: "Gemm_graph"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "C"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
