node {
  input: "input"
  input: "weight"
  output: "2"
  op_type: "PRelu"
}
name: "torch-jit-export"
initializer {
  dims: 1
  data_type: 1
  name: "weight"
  raw_data: "\000\000\200>"
}
input {
  name: "input"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 2
        }
      }
    }
  }
}
input {
  name: "weight"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 1
        }
      }
    }
  }
}
output {
  name: "2"
  type {
    tensor_type {
      elem_type: 1
      shape {
        dim {
          dim_value: 2
        }
      }
    }
  }
}
